SAR-mango/SinESC/Development/Original ST Software/STSW-ESC001V1/ESC_STM32_FOC_FW/Web/SystemDriveParams/Parameters conversion_F0xx.h
#define DELTA_TEMP_HYSTERESIS        (OV_TEMPERATURE_HYSTERESIS_C)
#define DELTA_V_HYSTERESIS           (dV_dT * DELTA_TEMP_HYSTERESIS)
#define OV_TEMPERATURE_HYSTERESIS_d  (DELTA_V_HYSTERESIS*INT_SUPPLY_VOLTAGE)
														  														  
/*************************  PWM IDLE STATES AND POLARITY  *********************/														  
#define H_ACTIVE_HIGH    0x0000u //TIM_OCPolarity_High
#define H_ACTIVE_LOW     0x0002u //TIM_OCPolarity_Low
#define L_ACTIVE_HIGH    0x0000u  //TIM_OCNPolarity_High
#define L_ACTIVE_LOW     0x0008u  //TIM_OCNPolarity_Low 

#define DOUT_ACTIVE_HIGH   DOutputActiveHigh
#define DOUT_ACTIVE_LOW    DOutputActiveLow

#define EMSTOP_ACTIVE_HIGH    TIM_BreakPolarity_High
#define EMSTOP_ACTIVE_LOW     TIM_BreakPolarity_Low

#if (HIGH_SIDE_IDLE_STATE == TURN_OFF)
#if (PHASE_UH_POLARITY == H_ACTIVE_HIGH)
#define IDLE_UH_POLARITY  TIM_OCIdleState_Reset
#else /* PHASE_UH_POLARITY = H_ACTIVE_LOW */
#define IDLE_UH_POLARITY  TIM_OCIdleState_Set
#endif
#else /* HIGH_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_UH_POLARITY == H_ACTIVE_HIGH)
#define IDLE_UH_POLARITY  TIM_OCIdleState_Set
#else /* PHASE_UH_POLARITY = H_ACTIVE_LOW */
#define IDLE_UH_POLARITY  TIM_OCIdleState_Reset
#endif
#endif

#if (HIGH_SIDE_IDLE_STATE == TURN_OFF)
#if	(PHASE_VH_POLARITY == H_ACTIVE_HIGH)
#define IDLE_VH_POLARITY  TIM_OCIdleState_Reset
#else /* PHASE_VH_POLARITY = H_ACTIVE_LOW */
#define IDLE_VH_POLARITY  TIM_OCIdleState_Set
#endif
#else /* HIGH_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_VH_POLARITY == H_ACTIVE_HIGH)
#define IDLE_VH_POLARITY  TIM_OCIdleState_Set
#else /* PHASE_VH_POLARITY = H_ACTIVE_LOW */
#define IDLE_VH_POLARITY  TIM_OCIdleState_Reset
#endif
#endif

#if (HIGH_SIDE_IDLE_STATE == TURN_OFF)
#if	(PHASE_WH_POLARITY == H_ACTIVE_HIGH)
#define IDLE_WH_POLARITY  TIM_OCIdleState_Reset
#else /* PHASE_WH_POLARITY = H_ACTIVE_LOW */
#define IDLE_WH_POLARITY  TIM_OCIdleState_Set
#endif
#else /* HIGH_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_WH_POLARITY == H_ACTIVE_HIGH)
#define IDLE_WH_POLARITY  TIM_OCIdleState_Set
#else /* PHASE_WH_POLARITY = H_ACTIVE_LOW */
#define IDLE_WH_POLARITY  TIM_OCIdleState_Reset
#endif
#endif

#if (LOW_SIDE_IDLE_STATE == TURN_OFF)
#if	(PHASE_UL_POLARITY == L_ACTIVE_HIGH)
#define IDLE_UL_POLARITY  TIM_OCNIdleState_Reset
#else /* PHASE_UL_POLARITY = L_ACTIVE_LOW */
#define IDLE_UL_POLARITY  TIM_OCNIdleState_Set
#endif
#else /* LOW_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_UL_POLARITY == L_ACTIVE_HIGH)
#define IDLE_UL_POLARITY  TIM_OCNIdleState_Set
#else /* PHASE_UL_POLARITY = L_ACTIVE_LOW */
#define IDLE_UL_POLARITY  TIM_OCNIdleState_Reset
#endif
#endif

#if (LOW_SIDE_IDLE_STATE == TURN_OFF)
#if	(PHASE_VL_POLARITY == L_ACTIVE_HIGH)
#define IDLE_VL_POLARITY  TIM_OCNIdleState_Reset
#else /* PHASE_VL_POLARITY = L_ACTIVE_LOW */
#define IDLE_VL_POLARITY  TIM_OCNIdleState_Set
#endif
#else /* LOW_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_VL_POLARITY == L_ACTIVE_HIGH)
#define IDLE_VL_POLARITY  TIM_OCNIdleState_Set
#else /* PHASE_VL_POLARITY = L_ACTIVE_LOW */
#define IDLE_VL_POLARITY  TIM_OCNIdleState_Reset
#endif
#endif

#if (LOW_SIDE_IDLE_STATE == TURN_OFF)
#if	(PHASE_WL_POLARITY == L_ACTIVE_HIGH)
#define IDLE_WL_POLARITY  TIM_OCNIdleState_Reset
#else /* PHASE_WL_POLARITY = L_ACTIVE_LOW */
#define IDLE_WL_POLARITY  TIM_OCNIdleState_Set
#endif
#else /* LOW_SIDE_IDLE_STATE = TURN_ON */
#if	(PHASE_WL_POLARITY == L_ACTIVE_HIGH)
#define IDLE_WL_POLARITY  TIM_OCNIdleState_Set
#else /* PHASE_WL_POLARITY = L_ACTIVE_LOW */
#define IDLE_WL_POLARITY  TIM_OCNIdleState_Reset
#endif
#endif

#if defined(SINGLE_SHUNT)
 #define CURRENT_REGULATION_IRQHandler          DMA1_Channel2_3_IRQHandler
#elif defined(THREE_SHUNT)
 #define CURRENT_REGULATION_IRQHandler          DMA1_Channel1_IRQHandler
#endif

#define TIMx_UP_BRK_M1_IRQHandler               TIM1_BRK_UP_TRG_COM_IRQHandler

/* TIMx MC IRQ Flag */
#define TIMx_UP_M1_IRQFlag              0
#define TIMx_BRK_M1_IRQFlag             2

#define DMAx_R1_M1_IRQHandler           DMA1_Channel4_5_IRQHandler
#define DMAx_R1_M1_TC_Flag              DMA1_FLAG_TC4

/* DMAx MC IRQ Flag*/
#define DMAx_TC_M1_IRQFlag              1

#define PWM_TIM1			TIM1
#define PWM_TIM8                        TIM8
#define PWM_NO_REMAP		    0 //Dummy
#define PWM_FULL_REMAP 		    0 //Dummy
#define PWM_PARTIAL_REMAP 	    0 //Dummy

#undef  PWM_TIMER_REMAPPING
#define PWM_TIMER_REMAPPING PWM_NO_REMAP

/**********  AUXILIARY TIMER (SINGLE SHUNT) *************/
#if ((defined(STM32F051x))||(defined(STM32F072x)))
#define R1_PWM_AUX_TIM                  TIM15
#elif ((defined(STM32F050x)) || (defined(STM32F030x)) || (defined(STM32F031x)) || (defined(STSPIN32F0)))
#define R1_PWM_AUX_TIM                  TIM3
#else
#error "Invalid configuration: MCU definition in Control stage parameters.h"
#endif

/**********  SPEED FEEDBACK TIMERS SETTING *************/
#if (defined(HALL_SENSORS) || defined(AUX_HALL_SENSORS))
  #if (HALL_TIMER_SELECTION == HALL_TIM2)
  #define HALL_TIMER 				TIM2  
  #define HALL_RCC_PERIPHERAL		RCC_APB1Periph_TIM2  
  #define HALL_IRQ_CHANNEL  		TIM2_IRQn
  #elif (HALL_TIMER_SELECTION == HALL_TIM3)
  #define HALL_TIMER 				TIM3  
  #define HALL_RCC_PERIPHERAL 	RCC_APB1Periph_TIM3
  #define HALL_IRQ_CHANNEL  		TIM3_IRQn  
  #elif (HALL_TIMER_SELECTION == HALL_TIM4)
  #define HALL_TIMER 				TIM4  
  #define HALL_RCC_PERIPHERAL 	RCC_APB1Periph_TIM4  
  #define HALL_IRQ_CHANNEL  		TIM4_IRQn
  #elif (HALL_TIMER_SELECTION == HALL_TIM5)
  #define HALL_TIMER 				TIM5  
  #define HALL_RCC_PERIPHERAL 	RCC_APB1Periph_TIM5
  #define HALL_IRQ_CHANNEL  		TIM5_IRQn  
  #else
  #error "Hall parameters not defined in Control Stage parametes.h"
  #endif
  #undef  HALL_TIMER_REMAPPING
  #define HALL_TIMER_REMAPPING  NO_REMAP_TIM2
#else
  /* Dummy value to avoid compiler error */
  #undef HALL_TIMER
  #undef HALL_TIMER_REMAPPING
  #undef HALL_RCC_PERIPHERAL
  #undef HALL_IRQ_CHANNEL
  #undef H1_GPIO_PORT
  #undef H2_GPIO_PORT
  #undef H3_GPIO_PORT
  #undef H1_GPIO_PIN
  #undef H2_GPIO_PIN
  #undef H3_GPIO_PIN
  #define HALL_TIMER 				    TIM2
  #define HALL_TIMER_REMAPPING  NO_REMAP_TIM2
  #define HALL_RCC_PERIPHERAL		RCC_APB1Periph_TIM2
  #define HALL_IRQ_CHANNEL  		TIM2_IRQn
  #define H1_GPIO_PORT          GPIOA
  #define H2_GPIO_PORT          GPIOA
  #define H3_GPIO_PORT          GPIOA
  #define H1_GPIO_PIN           GPIO_Pin_0
  #define H2_GPIO_PIN           GPIO_Pin_1
  #define H3_GPIO_PIN           GPIO_Pin_2
#endif

#if (defined(ENCODER) || defined(AUX_ENCODER))
  #if (ENC_TIMER_SELECTION == ENC_TIM2)
  #define ENC_TIMER 				TIM2  
  #define ENC_RCC_PERIPHERAL		RCC_APB1Periph_TIM2  
  #define ENC_IRQ_CHANNEL  		TIM2_IRQn
  #elif (ENC_TIMER_SELECTION == ENC_TIM3)
  #define ENC_TIMER 				TIM3  
  #define ENC_RCC_PERIPHERAL 		RCC_APB1Periph_TIM3
  #define ENC_IRQ_CHANNEL  		TIM3_IRQn  
  #elif (ENC_TIMER_SELECTION == ENC_TIM4)
  #define ENC_TIMER 				TIM4  
  #define ENC_RCC_PERIPHERAL 		RCC_APB1Periph_TIM4  
  #define ENC_IRQ_CHANNEL  		TIM4_IRQn
  #elif (ENC_TIMER_SELECTION == ENC_TIM5)
  #define ENC_TIMER 				TIM5  
  #define ENC_RCC_PERIPHERAL 		RCC_APB1Periph_TIM5
  #define ENC_IRQ_CHANNEL  		TIM5_IRQn  
  #else
  #error "Encoder parameters not defined in Control Stage parametes.h"
  #endif
  #undef  ENC_TIMER_REMAPPING
  #define ENC_TIMER_REMAPPING   NO_REMAP_TIM2
#else
  /* Dummy value to avoid compiler error */
  #undef  ENC_TIMER
  #undef  ENC_TIMER_REMAPPING
  #undef  ENC_RCC_PERIPHERAL
  #undef  ENC_IRQ_CHANNEL
  #undef  ENC_A_GPIO_PORT
  #undef  ENC_B_GPIO_PORT
  #undef  ENC_A_GPIO_PIN
  #undef  ENC_B_GPIO_PIN

  #define ENC_TIMER 				    TIM2
  #define ENC_TIMER_REMAPPING   NO_REMAP_TIM2
  #define ENC_RCC_PERIPHERAL		RCC_APB1Periph_TIM2
  #define ENC_IRQ_CHANNEL  		  TIM2_IRQn
  #define ENC_A_GPIO_PORT       GPIOA
  #define ENC_B_GPIO_PORT       GPIOA
  #define ENC_A_GPIO_PIN        GPIO_Pin_0
  #define ENC_B_GPIO_PIN        GPIO_Pin_1
#endif

/* Resistive Brake */
#if (ON_OVER_VOLTAGE != TURN_ON_R_BRAKE)
  /* Dummy value to avoid compiler error */
  #undef R_BRAKE_GPIO_PORT
  #undef R_BRAKE_GPIO_PIN
  
  #define R_BRAKE_GPIO_PORT     GPIOD
  #define R_BRAKE_GPIO_PIN      GPIO_Pin_13
#endif

/* Hardware over current protection bypass */
#if (HW_OV_CURRENT_PROT_BYPASS != ENABLE)
  /* Dummy value to avoid compiler error */
  #undef OV_CURR_BYPASS_GPIO_PORT
  #undef OV_CURR_BYPASS_GPIO_PIN
  
