SAR-mango/SinESC/Development/Original ST Software/STSW-ESC001V1/ESC_STM32_FOC_FW/Web/SystemDriveParams/Parameters conversion_F0xx.h
  #define OV_CURR_BYPASS_GPIO_PORT  GPIOD        
  #define OV_CURR_BYPASS_GPIO_PIN   GPIO_Pin_13
#endif

/* Inrush current limiter */
#if (INRUSH_CURRLIMIT_ENABLING != ENABLE)
  /* Dummy value to avoid compiler error */
  #undef INRUSH_CURRLIMIT_GPIO_PORT
  #undef INRUSH_CURRLIMIT_GPIO_PIN
  
  #define INRUSH_CURRLIMIT_GPIO_PORT  GPIOD
  #define INRUSH_CURRLIMIT_GPIO_PIN   GPIO_Pin_10
#endif

/* USART */
#if (SERIAL_COMMUNICATION != ENABLE)
  /* Dummy value to avoid compiler error */
  #undef USART_REMAPPING
  #undef USART_TX_GPIO_PORT
  #undef USART_TX_GPIO_PIN
  #undef USART_RX_GPIO_PORT
  #undef USART_SELECTION
  #undef USART_RX_GPIO_PIN
  
  #define USART_REMAPPING                 NO_REMAP_USART1
  #define USART_TX_GPIO_PORT              GPIOA
  #define USART_TX_GPIO_PIN               GPIO_Pin_9
  #define USART_RX_GPIO_PORT              GPIOA
  #define USART_SELECTION                 USE_USART1
  #define USART_RX_GPIO_PIN               GPIO_Pin_10
#endif

/* Current sensing topology */
#if (defined(SINGLE_SHUNT))
  /* Dummy value to avoid compiler error */
  #undef PHASE_U_CURR_ADC
  #undef PHASE_U_CURR_CHANNEL
  #undef PHASE_U_GPIO_PORT
  #undef PHASE_U_GPIO_PIN
  #undef PHASE_V_CURR_ADC
  #undef PHASE_V_CURR_CHANNEL
  #undef PHASE_V_GPIO_PORT
  #undef PHASE_V_GPIO_PIN
  #undef PHASE_W_CURR_ADC
  #undef PHASE_W_CURR_CHANNEL
  #undef PHASE_W_GPIO_PORT
  #undef PHASE_W_GPIO_PIN
  
  #define PHASE_U_CURR_ADC                ADC1_2
  #define PHASE_U_CURR_CHANNEL            ADC_Channel_11
  #define PHASE_U_GPIO_PORT               GPIOC
  #define PHASE_U_GPIO_PIN                GPIO_Pin_1
  #define PHASE_V_CURR_ADC                ADC1_2
  #define PHASE_V_CURR_CHANNEL            ADC_Channel_12
  #define PHASE_V_GPIO_PORT               GPIOC
  #define PHASE_V_GPIO_PIN                GPIO_Pin_2
  #define PHASE_W_CURR_ADC                ADC1_2
  #define PHASE_W_CURR_CHANNEL            ADC_Channel_13
  #define PHASE_W_GPIO_PORT               GPIOC
  #define PHASE_W_GPIO_PIN                GPIO_Pin_3
#elif (defined(ICS_SENSORS))
  /* Dummy value to avoid compiler error */
  #undef PHASE_W_CURR_ADC
  #undef PHASE_W_CURR_CHANNEL
  #undef PHASE_W_GPIO_PORT
  #undef PHASE_W_GPIO_PIN
  
  #define PHASE_W_CURR_ADC                ADC1_2
  #define PHASE_W_CURR_CHANNEL            ADC_Channel_13
  #define PHASE_W_GPIO_PORT               GPIOC
  #define PHASE_W_GPIO_PIN                GPIO_Pin_3
  
  #undef PHASE_CURRENTS_ADC
  #undef PHASE_CURRENTS_CHANNEL
  #undef PHASE_CURRENTS_GPIO_PORT
  #undef PHASE_CURRENTS_GPIO_PIN
  
  #define PHASE_CURRENTS_ADC              ADC3
  #define PHASE_CURRENTS_CHANNEL          ADC_Channel_12
  #define PHASE_CURRENTS_GPIO_PORT        GPIOC
  #define PHASE_CURRENTS_GPIO_PIN         GPIO_Pin_2
#else
  /* Dummy value to avoid compiler error */
  #undef PHASE_CURRENTS_ADC
  #undef PHASE_CURRENTS_CHANNEL
  #undef PHASE_CURRENTS_GPIO_PORT
  #undef PHASE_CURRENTS_GPIO_PIN
  
  #define PHASE_CURRENTS_ADC              ADC3
  #define PHASE_CURRENTS_CHANNEL          ADC_Channel_12
  #define PHASE_CURRENTS_GPIO_PORT        GPIOC
  #define PHASE_CURRENTS_GPIO_PIN         GPIO_Pin_2
#endif

#if (TEMPERATURE_READING != ENABLE)
  /* Dummy value to avoid compiler error */
  #undef TEMP_FDBK_GPIO_PORT
  #undef TEMP_FDBK_GPIO_PIN
  #define TEMP_FDBK_GPIO_PORT             GPIOA
  #define TEMP_FDBK_GPIO_PIN              GPIO_Pin_1
#endif

#if (BUS_VOLTAGE_READING != ENABLE)
  /* Dummy value to avoid compiler error */
  #undef VBUS_GPIO_PORT
  #undef VBUS_GPIO_PIN
  #define VBUS_GPIO_PORT                  GPIOA
  #define VBUS_GPIO_PIN                   GPIO_Pin_1
#endif

#if ((defined HALL_SENSORS) || (defined AUX_HALL_SENSORS))
#if (HALL_TIMER_SELECTION == HALL_TIM2)
#define SPD_TIM_M1_IRQHandler TIM2_IRQHandler
#elif (HALL_TIMER_SELECTION == HALL_TIM3)
#define SPD_TIM_M1_IRQHandler TIM3_IRQHandler
#else
#endif
#endif

#if ((defined ENCODER) || (defined AUX_ENCODER))
#if (ENC_TIMER_SELECTION == ENC_TIM2)
#define SPD_TIM_M1_IRQHandler TIM2_IRQHandler
#elif (ENC_TIMER_SELECTION == ENC_TIM3)
#define SPD_TIM_M1_IRQHandler TIM3_IRQHandler
#else
#endif
#endif

#if (HALL_ICx_FILTER <= 1)
#define HALL_IC_FILTER   0
#elif (HALL_ICx_FILTER <= 2)
#define HALL_IC_FILTER   1
#elif (HALL_ICx_FILTER <= 6)
#define HALL_IC_FILTER   2
#elif (HALL_ICx_FILTER <= 10)
#define HALL_IC_FILTER   3
#elif (HALL_ICx_FILTER <= 14)
#define HALL_IC_FILTER   4
#elif (HALL_ICx_FILTER <= 20)
#define HALL_IC_FILTER   5
#elif (HALL_ICx_FILTER <= 28)
#define HALL_IC_FILTER   6
#elif (HALL_ICx_FILTER <= 40)
#define HALL_IC_FILTER   7
#elif (HALL_ICx_FILTER <= 56)
#define HALL_IC_FILTER   8
#elif (HALL_ICx_FILTER <= 72)
#define HALL_IC_FILTER   9
#elif (HALL_ICx_FILTER <= 88)
#define HALL_IC_FILTER   10
#elif (HALL_ICx_FILTER <= 112)
#define HALL_IC_FILTER   11
#elif (HALL_ICx_FILTER <= 144)
#define HALL_IC_FILTER   12
#elif (HALL_ICx_FILTER <= 176)
#define HALL_IC_FILTER   13
#elif (HALL_ICx_FILTER <= 224)
#define HALL_IC_FILTER   14
#else
#define HALL_IC_FILTER   15
#endif


#if (ENC_ICx_FILTER <= 1)
#define ENC_IC_FILTER   0
#elif (ENC_ICx_FILTER <= 2)
#define ENC_IC_FILTER   1
#elif (ENC_ICx_FILTER <= 6)
#define ENC_IC_FILTER   2
#elif (ENC_ICx_FILTER <= 10)
#define ENC_IC_FILTER   3
#elif (ENC_ICx_FILTER <= 14)
#define ENC_IC_FILTER   4
#elif (ENC_ICx_FILTER <= 20)
#define ENC_IC_FILTER   5
#elif (ENC_ICx_FILTER <= 28)
#define ENC_IC_FILTER   6
#elif (ENC_ICx_FILTER <= 40)
#define ENC_IC_FILTER   7
#elif (ENC_ICx_FILTER <= 56)
#define ENC_IC_FILTER   8
#elif (ENC_ICx_FILTER <= 72)
#define ENC_IC_FILTER   9
#elif (ENC_ICx_FILTER <= 88)
#define ENC_IC_FILTER   10
#elif (ENC_ICx_FILTER <= 112)
#define ENC_IC_FILTER   11
#elif (ENC_ICx_FILTER <= 144)
#define ENC_IC_FILTER   12
#elif (ENC_ICx_FILTER <= 176)
#define ENC_IC_FILTER   13
#elif (ENC_ICx_FILTER <= 224)
#define ENC_IC_FILTER   14
#else
#define ENC_IC_FILTER   15
#endif
/*************** Encoder Alignemnt ************************/
    
/* Encoder alignment */
#define T_ALIGNMENT              ALIGNMENT_DURATION
#define ALIGNMENT_ANGLE_S16      (int16_t)  (ALIGNMENT_ANGLE_DEG*65536u/360u)

/*************** Timer for speed/position feedback   ******/
#define FULL_REMAP_TIM2			GPIO_NoRemap_TIMx
#define PARTIAL_REMAP_01_TIM2		GPIO_NoRemap_TIMx
#define PARTIAL_REMAP_10_TIM2		GPIO_NoRemap_TIMx
#define NO_REMAP_TIM2                   GPIO_NoRemap_TIMx

#define FULL_REMAP_TIM3			GPIO_NoRemap_TIMx
#define PARTIAL_REMAP_TIM3		GPIO_NoRemap_TIMx
#define NO_REMAP_TIM3                   GPIO_NoRemap_TIMx

#define REMAP_TIM4			GPIO_NoRemap_TIMx
#define NO_REMAP_TIM4                   GPIO_NoRemap_TIMx

#define NO_REMAP_TIM5                   GPIO_NoRemap_TIMx


/*************** Timer for PWM generation & currenst sensing parameters  ******/
#define PWM_PERIOD_CYCLES (uint16_t)(ADV_TIM_CLK_MHz*\
                                      (unsigned long long)1000000u/((uint16_t)(PWM_FREQUENCY)))

#if ((LOW_SIDE_SIGNALS_ENABLING == ENABLE)||(LOW_SIDE_SIGNALS_ENABLING == LS_PWM_TIMER_VAL))
#define DEADTIME_NS  SW_DEADTIME_NS
#else
#define DEADTIME_NS  HW_DEAD_TIME_NS
#endif

