SAR-mango/SinESC/Development/Original ST Software/STSW-ESC001V1/ESC_STM32_FOC_FW/Web/SystemDriveParams/Parameters conversion_F0xx.h
#if (LOG2(PLL_KPDIV)==-1)
  #error "Error: PLL_KPDIV defined in Drive parameters.h must be power of two."
#else
  #define PLL_KPDIV_LOG LOG2(PLL_KPDIV)
#endif

#if (LOG2(PLL_KIDIV)==-1)
  #error "Error: PLL_KIDIV defined in Drive parameters.h must be power of two."
#else
  #define PLL_KIDIV_LOG LOG2(PLL_KIDIV)
#endif

#if (LOG2(F1)==-1)
  #error "Error: F1 defined in Drive parameters.h must be power of two."
#else
  #define F1_LOG LOG2(F1)
#endif

#if (LOG2(F2)==-1)
  #error "Error: F2 defined in Drive parameters.h must be power of two."
#else
  #define F2_LOG LOG2(F2)
#endif

#if (LOG2(STO_FIFO_DEPTH_DPP)==-1)
  #error "Error: STO_FIFO_DEPTH_DPP in Drive parameters.h must be power of two."
#else
  #define STO_FIFO_DEPTH_DPP_LOG LOG2(STO_FIFO_DEPTH_DPP)
#endif

#if (LOG2(CORD_FIFO_DEPTH_DPP)==-1)
  #error "Error: CORD_FIFO_DEPTH_DPP in Drive parameters.h must be power of two."
#else
  #define CORD_FIFO_DEPTH_DPP_LOG LOG2(CORD_FIFO_DEPTH_DPP)
#endif

#if (LOG2(HFI_PID_KPDIV)==-1)
  #error "Error: HFI_PID_KPDIV defined in Drive parameters.h must be power of two."
#else
  #define HFI_PID_KPDIV_LOG LOG2(HFI_PID_KPDIV)
#endif

#if (LOG2(HFI_PID_KIDIV)==-1)
  #error "Error: HFI_PID_KIDIV defined in Drive parameters.h must be power of two."
#else
  #define HFI_PID_KIDIV_LOG LOG2(HFI_PID_KIDIV)
#endif

#if (BUS_VOLTAGE_READING == ENABLE)
 #if ((OV_VOLTAGE_PROT_ENABLING != ENABLE) || (UV_VOLTAGE_PROT_ENABLING!= ENABLE))
  #error "Configuration not supported by this version of the library. Under and Over voltage protections (motor 1) must be enabled if bus voltage sensing is enabled."
 #else
  #define BUS_VOLTAGE_MEASUREMENT
 #endif
#endif

#if ((TEMPERATURE_READING == ENABLE) && (OV_TEMPERATURE_PROT_ENABLING == ENABLE))
 #define HEAT_SINK_TEMPERATURE_MEASUREMENT
#endif

#define VIRTUAL_HEAT_SINK_TEMPERATURE_VALUE   25u

#define TEMP_SW_FILTER_BW_FACTOR      250u
#define VQD_SW_FILTER_BW_FACTOR       128
#define VBUS_SW_FILTER_BW_FACTOR      10u

#if (LOG2(VQD_SW_FILTER_BW_FACTOR)==-1)
  #error "Error: VQD_SW_FILTER_BW_FACTOR defined in Drive parameters.h must be power of two."
#else
  #define VQD_SW_FILTER_BW_FACTOR_LOG LOG2(VQD_SW_FILTER_BW_FACTOR)
#endif

#if (VBUS_ADC_SAMPLING_TIME == 1)
#define VBUS_SAMPLING_TIME  ADC_SampleTime_1_5Cycles
#elif (VBUS_ADC_SAMPLING_TIME == 7)
#define VBUS_SAMPLING_TIME  ADC_SampleTime_7_5Cycles
#elif (VBUS_ADC_SAMPLING_TIME == 13)
#define VBUS_SAMPLING_TIME  ADC_SampleTime_13_5Cycles
#elif (VBUS_ADC_SAMPLING_TIME == 28)
#define VBUS_SAMPLING_TIME  ADC_SampleTime_28_5Cycles
#else
#define VBUS_SAMPLING_TIME  ADC_SampleTime_1_5Cycles
#endif

#if (TEMP_ADC_SAMPLING_TIME == 1)
#define TEMP_SAMPLING_TIME  ADC_SampleTime_1_5Cycles
#elif (TEMP_ADC_SAMPLING_TIME == 7)
#define TEMP_SAMPLING_TIME  ADC_SampleTime_7_5Cycles
#elif (TEMP_ADC_SAMPLING_TIME == 13)
#define TEMP_SAMPLING_TIME  ADC_SampleTime_13_5Cycles
#elif (TEMP_ADC_SAMPLING_TIME == 28)
#define TEMP_SAMPLING_TIME  ADC_SampleTime_28_5Cycles
#else
#define TEMP_SAMPLING_TIME  ADC_SampleTime_1_5Cycles
#endif

#undef ADC_Channel_0
#undef ADC_Channel_1
#undef ADC_Channel_2
#undef ADC_Channel_3
#undef ADC_Channel_4
#undef ADC_Channel_5
#undef ADC_Channel_6
#undef ADC_Channel_7
#undef ADC_Channel_8
#undef ADC_Channel_9
#undef ADC_Channel_10
#undef ADC_Channel_11
#undef ADC_Channel_12
#undef ADC_Channel_13
#undef ADC_Channel_14
#undef ADC_Channel_15
#undef ADC_Channel_16
#undef ADC_Channel_17
#undef ADC_Channel_18

#define ADC_Channel_0                               ((uint8_t)0x00)
#define ADC_Channel_1                               ((uint8_t)0x01)
#define ADC_Channel_2                               ((uint8_t)0x02)
#define ADC_Channel_3                               ((uint8_t)0x03)
#define ADC_Channel_4                               ((uint8_t)0x04)
#define ADC_Channel_5                               ((uint8_t)0x05)
#define ADC_Channel_6                               ((uint8_t)0x06)
#define ADC_Channel_7                               ((uint8_t)0x07)
#define ADC_Channel_8                               ((uint8_t)0x08)
#define ADC_Channel_9                               ((uint8_t)0x09)
#define ADC_Channel_10                              ((uint8_t)0x0A)
#define ADC_Channel_11                              ((uint8_t)0x0B)
#define ADC_Channel_12                              ((uint8_t)0x0C)
#define ADC_Channel_13                              ((uint8_t)0x0D)
#define ADC_Channel_14                              ((uint8_t)0x0E)
#define ADC_Channel_15                              ((uint8_t)0x0F)
#define ADC_Channel_16                              ((uint8_t)0x10)
#define ADC_Channel_17                              ((uint8_t)0x11)
#define ADC_Channel_18                              ((uint8_t)0x12)

#if ((defined STATE_OBSERVER_PLL) || (defined STATE_OBSERVER_CORDIC))
#define NO_SPEED_SENSORS
#endif

#if LCD_JOYSTICK_FUNCTIONALITY == ENABLE
#define LCD_FUNCTIONALITY
#endif

#if (defined STM32PERFORMANCEMD) || (defined STM32PERFORMANCELD)
#define STM32PERFORMANCE
#endif
#if defined STM32PERFORMANCEHD 
#define STM32HD
#endif
#if (defined STM32VALUEMD) || (defined STM32VALUELD)
#define STM32VALUE
#endif

#if (MTPA_ENABLING == ENABLE)
#define IPMSM_MTPA
#endif

#if (FEED_FORWARD_CURRENT_REG_ENABLING == ENABLE)
#define FEED_FORWARD_CURRENT_REGULATION
#endif

#if (FLUX_WEAKENING_ENABLING == ENABLE)
#define FLUX_WEAKENING
#endif

#if defined AUX_ENCODER
#define VIEW_ENCODER_FEEDBACK
#endif

#if defined AUX_HALL_SENSORS
#define VIEW_HALL_FEEDBACK
#endif

#if (DAC_FUNCTIONALITY == DISABLE)
#undef DAC_FUNCTIONALITY
#endif

#if (SERIAL_COMMUNICATION == DISABLE)
#undef SERIAL_COMMUNICATION
#endif

/* Number of MC object */

#ifdef SINGLEDRIVE
  #define MC_NUM 1
#endif

#ifdef DUALDRIVE
  #define MC_NUM 2
#endif

#if (defined(SINGLE_SHUNT) || defined(THREE_SHUNT))
#define PQD_CONVERSION_FACTOR (int32_t)(( 1000 * 3 * MCU_SUPPLY_VOLTAGE ) /\
             ( 1.732 * RSHUNT * AMPLIFICATION_GAIN ))
#endif

#if (defined(ICS_SENSORS))
#define PQD_CONVERSION_FACTOR (int32_t)(( 1000 * 3 * MCU_SUPPLY_VOLTAGE ) /\
             ( 1.732 * AMPLIFICATION_GAIN ))
#endif

/*********************** Usart remapping  ***********************/
#define USE_USART1 0
#define USE_USART2 1
#define USE_USART3 2

#define NO_REMAP_USART1       0
#define REMAP_USART1          1
#define NO_REMAP_USART2       2
#define REMAP_USART2          3
#define NO_REMAP_USART3       4
#define FULL_REMAP_USART3     5
#define PARTIAL_REMAP_USART3  6

#define GPIO_NoRemap_USARTx 0

#if (USART_SELECTION == USE_USART1)
  #define USART                   USART1
  #define USART_CLK               RCC_APB2Periph_USART1
  #define USART_IRQ               USART1_IRQn
  #define USART_IRQHandler        USART1_IRQHandler
  #define USART_GPIO_REMAP      GPIO_NoRemap_USARTx /* Dummy */
#endif

#if (USART_SELECTION == USE_USART2)
  #define USART                   USART2
  #define USART_CLK               RCC_APB1Periph_USART2
  #define USART_IRQ               USART2_IRQn
  #define USART_IRQHandler        USART2_IRQHandler
  #define USART_GPIO_REMAP        GPIO_NoRemap_USARTx /* Dummy */
#endif

#define NVIC_USART_INIT_STR \
const NVIC_InitTypeDef NVICInitHW_str =\
{\
  USART_IRQ,  /* NVIC_IRQChannel */\
  USART_PRE_EMPTION_PRIORITY,            /* NVIC_IRQChannelPreemptionPriority */\
  (FunctionalState)(ENABLE)        /* NVIC_IRQChannelCmd */\
};

/****** Prepares the UI configurations according the MCconfxx settings ********/
#ifdef LCD_FUNCTIONALITY
  #define LCD_ENABLE |OPT_LCD
#else
  #define LCD_ENABLE 
#endif

#ifdef SERIAL_COMMUNICATION
  #define COM_ENABLE |OPT_COM
#else
  #define COM_ENABLE
#endif

#ifdef DAC_FUNCTIONALITY
  #define DAC_ENABLE |OPT_DAC
  #define DAC_OP_ENABLE |UI_CFGOPT_DAC
  #if defined(STM32F072x)
    #define DAC_OPTION OPT_DACF072
  #else
    #define DAC_OPTION OPT_DAC
  #endif
#else
  #define DAC_ENABLE
  #define DAC_OP_ENABLE
#endif

/* Motor 1 settings */
#ifdef FLUX_WEAKENING
  #define FW_ENABLE |UI_CFGOPT_FW
#else
  #define FW_ENABLE
#endif

#ifdef DIFFERENTIAL_TERM_ENABLED
  #define DIFFTERM_ENABLE |UI_CFGOPT_SPEED_KD|UI_CFGOPT_Iq_KD|UI_CFGOPT_Id_KD
#else
  #define DIFFTERM_ENABLE
#endif

/* Sensors setting */
#ifdef STATE_OBSERVER_PLL
  #define MAIN_SCFG UI_SCODE_STO_PLL
#endif

