SAR-mango/SinESC/Development/Original ST Software/STSW-ESC001V1/ESC_STM32_FOC_FW/Web/SystemDriveParams/Parameters conversion_F0xx.h
#ifdef STATE_OBSERVER_CORDIC
  #define MAIN_SCFG UI_SCODE_STO_CR
#endif

#ifdef AUX_STATE_OBSERVER_PLL
  #define AUX_SCFG UI_SCODE_STO_PLL
#endif

#ifdef AUX_STATE_OBSERVER_CORDIC
  #define AUX_SCFG UI_SCODE_STO_CR
#endif

#ifdef ENCODER
  #define MAIN_SCFG UI_SCODE_ENC
#endif

#ifdef VIEW_ENCODER_FEEDBACK
  #define AUX_SCFG UI_SCODE_ENC
#endif

#ifdef HALL_SENSORS
  #define MAIN_SCFG UI_SCODE_HALL
#endif

#ifdef VIEW_HALL_FEEDBACK
  #define AUX_SCFG UI_SCODE_HALL
#endif

#ifndef AUX_SCFG
#define AUX_SCFG 0x0
#endif

#if defined(PLLTUNING)
  #define PLLTUNING_ENABLE |UI_CFGOPT_PLLTUNING
#else
  #define PLLTUNING_ENABLE
#endif

#if defined(PFC_ENABLED)
  #define UI_CFGOPT_PFC_ENABLE |UI_CFGOPT_PFC
#else
  #define UI_CFGOPT_PFC_ENABLE
#endif

/******************************************************************************* 
  * UI configurations settings. It can be manually overwritten if special 
  * configuartion is required. 
*******************************************************************************/

/* Base configuration of UI */
#define UI_INIT_CFG ( OPT_NONE LCD_ENABLE COM_ENABLE DAC_ENABLE )

/* Specific options of UI */
#define UI_CONFIG_M1 ( UI_CFGOPT_NONE DAC_OP_ENABLE FW_ENABLE DIFFTERM_ENABLE \
  | (MAIN_SCFG << MAIN_SCFG_POS) | (AUX_SCFG << AUX_SCFG_POS) | UI_CFGOPT_SETIDINSPDMODE PLLTUNING_ENABLE UI_CFGOPT_PFC_ENABLE | UI_CFGOPT_PLLTUNING)

#ifdef SINGLEDRIVE
  #define UI_CONFIG_M2
#endif

/* Push button definitions */
#define BUTTON_KEY_ACTIVE   Bit_RESET
#define BUTTON_KEY_INACTIVE Bit_SET
#define JOYSTIK_ACTIVE      Bit_SET
#define JOYSTIK_INACTIVE    Bit_RESET

#endif /*__PARAMETERS_CONVERSION_F10X_H*/

/******************* (C) COPYRIGHT 2016 STMicroelectronics *****END OF FILE****/
